app/controllers/articles_controller.rb

  def index
    @article = Article.all
---
SELECT "articles".* FROM "articles"

  def create
    @article = Article.new(article_params)
    if @article.save
---
INSERT INTO "articles" ("title", "created_at", "updated_at", "description") VALUES (?, ?, ?, ?)  [["title", "new article "], ["created_at", "2022-04-16 11:29:36.972688"], ["updated_at", "2022-04-16 11:29:36.972688"], ["description", "new descriptions\n"]]

  def update
    # @article = Article.find(params[:id])
    if @article.update(article_params)
---
UPDATE "articles" SET "title" = ?, "updated_at" = ?, "description" = ? WHERE "articles"."id" = ?  [["title", "first article updated"], ["updated_at", "2022-04-16 11:31:24.773368"], ["description", "simple description updated"], ["id", 16]]

  def destroy
    # @article = Article.find(params[:id])
    @article.destroy
---
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 20]]