app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "aman2001mi@gmail.com"], ["updated_at", "2022-05-03 13:53:57.027557"], ["id", 1]]
---
    def update
        @user = User.find(params[:id])
        if @user.update(user_params)